Strogino/src/Documents/ПриемкаМаршрута/ПриемкаМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемкаМаршрута</name>
  <basedOn>Document.МаршрутНаАптеку</basedOn>
  <registerRecords>InformationRegister.ОтправкаСМС</registerRecords>
  <registerRecords>AccumulationRegister.МестаЗаказов</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутНаАптеку</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.Заказ</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.НаклейкиМестЗаказа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/AccumulationRegisters/МестаЗаказов/МестаЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>МестаЗаказов</name>
  <resources>
    <name>Приемка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Раскладка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>DocumentRef.МаршрутНаАптеку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоЗаказа</name>
    <type>
      <types>CatalogRef.НаклейкиМестЗаказа</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Strogino/src/InformationRegisters/ОтправкаСМС/ОтправкаСМС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтправкаСМС</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Выгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>АдресХранения</name>
    <type>
      <types>CatalogRef.АдресХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>created</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sms</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>approved</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_t_tc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>iddoc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Strogino/src/Documents/ПриемкаМаршрута/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.МестаЗаказов.Записывать = Истина;
	Движения.МестаЗаказов.Очистить();
	Для каждого строка из Состав Цикл
		Движение = Движения.МестаЗаказов.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Маршрут = ДокументОснование;
		Движение.Заказ = Строка.Заказ;
		Движение.МестоЗаказа = Строка.МестоЗаказа;
		Движение.Приемка = 1;
		
		Движение = Движения.МестаЗаказов.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Регистратор = Ссылка;
		Движение.Маршрут = ДокументОснование;
		Движение.Заказ = Строка.Заказ;
		Движение.МестоЗаказа = Строка.МестоЗаказа;
		Движение.Раскладка= 1;
	КонецЦикла;
	Движения.ОтправкаСМС.Записывать = Истина;
	Движения.ОтправкаСМС.Прочитать();
	Если Движения.ОтправкаСМС.Количество() > 0 тогда
		Возврат;
	КонецЕсли;    
	МассивЗаказов = Новый Массив;
	Для каждого строка из Состав Цикл
		Телефон = СокрЛП(Лев(Строка.Заказ.Телефон,10));
		Если СтрДлина(Телефон) < 10 тогда
			Продолжить;
		КонецЕсли;
		Если Лев(Телефон,3) = "495" или Лев(Телефон,3) = "499"
			или Лев(Телефон,3) = "496" или Лев(Телефон,3) = "812" тогда
			Продолжить;
		КонецЕсли;
		Если МассивЗаказов.Найти(Строка.Заказ) <> неопределено тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ОтправкаСМС.Добавить();
		Движение.Период = Дата;
		Движение.created = Ответственный.Наименование;
		Движение.phone = Телефон;
		//Движение.sms = СокрЛП("Ваш заказ "+СокрЛП(Строка.Заказ.Номер)+" поступил в аптеку "+СокрЛП(Строка.Заказ.ТочкаСамовывоза.Наименование));
		Движение.sms = СокрЛП("Заказ №"+СокрЛП(Строка.Заказ.Номер)+" ожидает в аптеке "+СокрЛП(Строка.Заказ.ТочкаСамовывоза.АдресХранения.Адрес))+". Сумма "+Формат(Строка.Заказ.Товар.Итог("Всего"),"ЧДЦ=2")+" р.";
		Движение.approved = "auto";
		Движение.id_t_tc = СокрЛП(Строка(Строка.Заказ.ТипЦены.Код));
		Движение.iddoc = Строка.Заказ.ID_77;
		Движение.type = 1;
		МассивЗаказов.Добавить(Строка.Заказ);
	КонецЦикла;
КонецПроцедуры
